script
clc
clear
disp('% кп ╧12. яхмрег йху-тхкэрпю тмв лернднл веашьебяйни юоопнйяхлюжхх')
disp('%')
disp('%')
disp('% О.1. ббнд рпеанбюмхи й юву тмв')
disp('%')
disp('%')
disp('% бБЕДХРЕ мнлеп апхцюдш Х рпеанбюмхъ Й юву')
DATA=0;
while DATA==0;
Nb = input('Nb = ');        % мнлеп апхцюдш
Fs = input('Fs = ');        % вюярнрю дхяйперхгюжхх (цЖ)
ft = input ('ft = ');       % цпюмхвмюъ вюярнрю оо (цЖ)
fk = input ('fk = ');       % цпюмхвмюъ вюярнрю ог (цЖ)
d1 = input('d1 = ');        % люйяхлюкэмн дносярхлне нрйкнмемхе б оо
d2 = input('d2 = ');        % люйяхлюкэмн дносярхлне нрйкнмемхе б ог
Ap = input('Ap = ');        % люйяхлюкэмн дносярхлне гюрсуюмхе б оо
Ast = input('Ast = ');      % лхмхлюкэмн дносярхлне гюрсуюмхе б ог
disp('% оПНБЕПЭРЕ опюбхкэмнярэ ББНДЮ хяундмшу дюммшу')
disp('% оПХ опюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 1')
disp('% оПХ меопюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 0 Х онбрнпхре ББНД')
DATA = input('--> ');
end
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.2. бшвхякемхе оюпюлерпнб тсмйжхх firpmord')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ онпъдйю йху-ТХКЭРПЮ (R) Х беянб  Б оо Х ог (weight) МЮФЛХРЕ <ENTER>')
pause
m = [1 0];                % бейрнп гмювемхи хдеюкэмни юву
f = [ft fk];              % бейрнп цпюмхвмшу вюярнр
ripple = [d1 d2];         % бейрнп люйяхлюкэмн дносярхлшу нрйкнмемхи
[R,f0,m0,weight] = firpmord(f,m,ripple,Fs);% бшвхякемхе оюпюлерпнб тсмйжхх firpmord
disp('%')
disp(['R = ' num2str(R)])               % нжемйю онпъдйю йху-тхкэрпю
weight = [weight(1) weight(2)]          % беяю б оо Х ог
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.3. яхмрег йху-тхкэрпю тмв')
ORDER = 0; % опхгмюй норхлюкэмнярх онпъдйю йху-тхкэрпю: 0 ≈ менорхлюкэмши; 1 - норхлюкэмши
while ORDER==0;
disp('%')
disp('%')
disp('% дКЪ ЯХМРЕГЮ йху-ТХКЭРПЮ тмв МЮФЛХРЕ <ENTER>')
pause
[b1,error,opt] = firpm(R,f0,m0,weight);     % йнщттхжхемрш йху-тхкэрпю тмв b1
disp('%')
disp('%')
disp(['  яХМРЕГХПНБЮМ йху-ТХКЭРП тмв ОНПЪДЙЮ R = ' num2str(R)])
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ люйяхлюкэмни бгбеьеммни ньхайх юоопнйяхлюжхх error')
disp('% Х дносярхлнцн бгбеьеммнцн нрйкнмемхъ max{d1,d2} МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp(['error = ' num2str(error)])           % тюйрхвеяйне люйяхлюкэмне нрйкнмемхе юву нр хдеюкэмни
disp(['max{d1,d2} = ' num2str(max(d1,d2))]) % гюдюммне нрйкнмемхе max{d1,d2}
disp('%')
disp('%')
disp('% яПЮБМХРЕ тюйрхвеяйне НРЙКНМЕМХЕ юву Я гюдюммшл')
disp('%')
disp('% еЯКХ онпъднй ЯННРБЕРЯРБСЕР лхмхлюкэмнлс, ББЕДХРЕ 1')
disp('% еЯКХ ме ЯННРБЕРЯРБСЕР, ББЕДХРЕ 0 Х ГЮРЕЛ онпъднй R')
ORDER = input('--> ');
if ORDER==0
R = input('R = ');                           % онпъднй йху-тхкэрпю
end
end
disp('%')
disp([' яХМРЕГХПНБЮМ НОРХЛЮКЭМШИ тмв ОНПЪДЙЮ R = ' num2str(R)])
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.4. юмюкхг уюпюйрепхярхй йху-тхкэрпю тмв')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ цпютхйнб ху, юву х тву МЮФЛХРЕ <ENTER>')
pause
figure('Name','Lowpass FIR Filter - Impulse Response, Magnitude, Phase','NumberTitle', 'off')
plot_fir(R,b1,Fs)                % онярпнемхе цпютхйнб ху, юву Х тву
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.5 бшбнд цпютхйю юву норхлюкэмнцн йху-тхкэрпю я нрлевеммшлх вюярнрюлх юкэрепмюмяю')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ цпютхйю юву я вюярнрюлх юкэрепмюмяю МЮФЛХРЕ <ENTER>')
pause
fextr = opt.fextr;              % бейрнп мнплхпнбюммшу вюярнр юкэрепмюмяю
figure('Name','Lowpass Filter - Magnitude','NumberTitle', 'off')
MAG_fir(b1,opt.fextr,f0,m0,Fs)  % цпютхй юву я вюярнрюлх юкэрепмюмяю
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.6. нохяюмхе рпеанбюмхи й юву йху-ТХКЭРПЮ тмв б бхде назейрю fdesign')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ ябниярб назейрю fdesign МЮФЛХРЕ <ENTER>')
pause
MAG_lowpass = fdesign.lowpass('Fp,Fst,Ap,Ast',ft,fk,Ap,Ast,Fs) % назейр fdesign дкъ тмв
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.7. яхмрег йху-тхкэрпю б бхде назейрю dfilt мю нямнбе назейрю fdesign')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ ябниярб назейрю dfilt МЮФЛХРЕ <ENTER>')
pause
F_lowpass = equiripple(MAG_lowpass)    % тмв  б бхде назейрю dfilt
disp('%')
disp('%')
disp('% яхмрег йху-тхкэрпю тмв гюбепьем')



























































