script
clc
clear
disp('% кп ╧12. яхмрег йху-тхкэрпю от лернднл веашьебяйни юоопнйяхлюжхх')
disp('%')
disp('%')
disp('% О.1. ббнд рпеанбюмхи й юву от')
disp('%')
disp('%')
disp('% бБЕДХРЕ мнлеп апхцюдш Х рпеанбюмхъ Й юву')
DATA=0;
while DATA==0;
Nb = input('Nb = ');       % мнлеп апхцюдш
Fs = input('Fs = ');       % вюярнрю дхяйперхгюжхх (цЖ)
fk1 = input('fk1 = ');     % цпюмхвмюъ вюярнрю ог1 (цЖ)
ft1 = input('ft1 = ');     % цпюмхвмюъ вюярнрю оо (цЖ)
ft2 = input('ft2 = ');     % цпюмхвмюъ вюярнрю оо (цЖ)
fk2 = input('fk2 = ');     % цпюмхвмюъ вюярнрю ог2 (цЖ)
d21 = input('d21 = ');     % люйяхлюкэмн дносярхлне нрйкнмемхе б ог1
d1 = input('d1 = ');       % люйяхлюкэмн дносярхлне нрйкнмемхе б оо
d22 = input('d22 = ');     % люйяхлюкэмн дносярхлне нрйкнмемхе б ог2
Ast1 = input('Ast1 = ');   % лхмхлюкэмн дносярхлне гюрсуюмхе б ог1
Ap = input('Ap = ');       % люйяхлюкэмн дносярхлне гюрсуюмхе б оо
Ast2 = input('Ast2 = ');   % лхмхлюкэмн дносярхлне гюрсуюмхе б ог2
disp('% оПНБЕПЭРЕ опюбхкэмнярэ ББНДЮ хяундмшу дюммшу')
disp('% оПХ опюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 1')
disp('% оПХ меопюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 0 Х онбрнпхре ББНД')
DATA = input('--> ');
end
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.2. бшвхякемхе оюпюлерпнб тсмйжхх firpmord')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ онпъдйю йху-ТХКЭРПЮ (R) Х беянб  Б ог1, оо Х ог2 (weight) МЮФЛХРЕ <ENTER>')
pause
m = [0 1 0];              % бейрнп гмювемхи хдеюкэмни юву
f = [fk1 ft1 ft2 fk2];    % бейрнп цпюмхвмшу вюярнр
ripple = [d21 d1 d22];    % бейрнп люйяхлюкэмн дносярхлшу нрйкнмемхи
[R,f0,m0,weight] = firpmord(f,m,ripple,Fs);% бшвхякемхе оюпюлерпнб тсмйжхх firpmord
disp('%')
disp(['R = ' num2str(R)])                   % нжемйю онпъдйю тхкэрпю
weight = [weight(1) weight(2) weight(3)]    % беяю б ог Х оо
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.3. яхмрег йху-тхкэрпю от')
ORDER = 0; % опхгмюй норхлюкэмнярх онпъдйю йху-тхкэрпю: 0 ≈ менорхлюкэмши; 1 - норхлюкэмши
ftype = ' ';      % 1-и хкх 2-и рхо рхо йху-тхкэрпю тбв он слнквюмхч
while ORDER==0;
disp('%')
disp('%')
disp('% дКЪ ЯХМРЕГЮ йху-ТХКЭРПЮ от МЮФЛХРЕ <ENTER>')
pause
[b3,error,opt] = firpm(R,f0,m0,weight,ftype);     % йнщттхжхемрш йху-тхкэрпю от b3
disp('%')
disp('%')
disp(['  яХМРЕГХПНБЮМ йху-ТХКЭРП от ОНПЪДЙЮ R = ' num2str(R)])
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ люйяхлюкэмни бгбеьеммни ньхайх юоопнйяхлюжхх error')
disp('% Х дносярхлнцн бгбеьеммнцн нрйкнмемхъ max{d21,d2,d22} МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp(['error = ' num2str(error)])       % тюйрхвеяйне люйяхлюкэмне нрйкнмемхе юву нр хдеюкэмни
disp(['max{d21,d1,d22} = ' num2str(max([d21,d1,d22]))]) % гюдюммне нрйкнмемхе max{d21,d1,d22}
disp('%')
disp('%')
disp('% яПЮБМХРЕ тюйрхвеяйне НРЙКНМЕМХЕ юву Я гюдюммшл')
disp('%')
disp('%')
disp('% еЯКХ онпъднй ЯННРБЕРЯРБСЕР лхмхлюкэмнлс, ББЕДХРЕ 1')
disp('% еЯКХ ме ЯННРБЕРЯРБСЕР, ББЕДХРЕ 0 Х ГЮРЕЛ онпъднй R')
disp('% Х рхо йху=ТХКЭРПЮ ftype - ОПНАЕК ХКХ hilbert б юонярпнтюу')
disp('% норхлюкэмши от БШАХПЮЕРЯЪ ЯПЕДХ бяеу вершпеу рхонб йху-ТХКЭРПНБ!')
ORDER = input('--> ');
if ORDER==0
R = input('R = ');                      % онпъднй йху-тхкэрпю
ftype = input('ftype = ');
end
end
disp('%')
disp([' яХМРЕГХПНБЮМ НОРХЛЮКЭМШИ от ОНПЪДЙЮ R = ' num2str(R)])
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.4. юмюкхг уюпюйрепхярхй йху-тхкэрпю от')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ цпютхйнб ху, юву х тву МЮФЛХРЕ <ENTER>')
pause
figure('Name','Bandpass FIR Filter - Impulse Response, Magnitude, Phase','NumberTitle', 'off')
plot_fir(R,b3,Fs)                % онярпнемхе цпютхйнб ху, юву Х тву
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.5. бшбнд цпютхйю юву норхлюкэмнцн йху-тхкэрпю я нрлевеммшлх вюярнрюлх юкэрепмюмяю')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ цпютхйю юву я вюярнрюлх юкэрепмюмяю МЮФЛХРЕ <ENTER>')
pause
fextr = opt.fextr;              % бейрнп мнплхпнбюммшу вюярнр юкэрепмюмяю
figure('Name','Bandpass Filter - Magnitude','NumberTitle', 'off')
MAG_fir(b3,opt.fextr,f0,m0,Fs)  % цпютхй юву я вюярнрюлх юкэрепмюмяю
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.6. нохяюмхе рпеанбюмхи й юву йху-ТХКЭРПЮ от б бхде назейрю fdesign')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ ябниярб назейрю fdesign МЮФЛХРЕ <ENTER>')
pause
MAG_bandpass = fdesign.bandpass('Fst1,Fp1,Fp2,Fst2,Ast1,Ap,Ast2',fk1,ft1,ft2,fk2,Ast1,Ap,Ast2,Fs)         % назейр fdesign дкъ от
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.7. яхмрег йху-тхкэрпю б бхде назейрю dfilt мю нямнбе назейрю fdesign')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ ябниярб назейрю dfilt МЮФЛХРЕ <ENTER>')
pause
F_bandpass = equiripple(MAG_bandpass)     % от б бхде назейрю dfilt
disp('%')
disp('%')
disp('% яхмрег йху-тхкэрпю от гюбепьем')
























































