script
clc
clear
disp('% кп ╧12. яхмрег йху-тхкэрпю пт лернднл веашьебяйни юоопнйяхлюжхх')
disp('%')
disp('%')
disp('% О.1. ббнд рпеанбюмхи й юву пт')
disp('%')
disp('%')
disp('% бБЕДХРЕ мнлеп апхцюдш Х рпеанбюмхъ Й юву')
DATA=0;
while DATA==0;
Nb = input('Nb = ');       % мнлеп апхцюдш
Fs = input('Fs = ');       % вюярнрю дхяйперхгюжхх (цЖ)
ft1 = input('ft1 = ');     % цпюмхвмюъ вюярнрю оо1 (цЖ)
fk1 = input('fk1 = ');     % цпюмхвмюъ вюярнрю ог (цЖ)
fk2 = input('fk2 = ');     % цпюмхвмюъ вюярнрю ог (цЖ)
ft2 = input('ft2 = ');     % цпюмхвмюъ вюярнрю оо2 (цЖ)
d11 = input('d11 = ');     % люйяхлюкэмн дносярхлне нрйкнмемхе б оо1
d2 = input('d2 = ');       % люйяхлюкэмн дносярхлне нрйкнмемхе б ог
d12 = input('d12 = ');     % люйяхлюкэмн дносярхлне нрйкнмемхе б оо2
Ap1 = input('Ap1 = ');     % люйяхлюкэмн дносярхлне гюрсуюмхе б оо1
Ast = input('Ast = ');     % лхмхлюкэмн дносярхлне гюрсуюмхе б ог
Ap2 = input('Ap2 = ');     % люйяхлюкэмн дносярхлне гюрсуюмхе б оо2
disp('% оПНБЕПЭРЕ опюбхкэмнярэ ББНДЮ хяундмшу дюммшу')
disp('% оПХ опюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 1')
disp('% оПХ меопюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 0 Х онбрнпхре ББНД')
DATA = input('--> ');
end
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.2. бшвхякемхе оюпюлерпнб тсмйжхх firpmord')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ онпъдйю йху-ТХКЭРПЮ (R) Х беянб  Б оо1, ог Х оо2 (weight) МЮФЛХРЕ <ENTER>')
pause
m = [1 0 1];              % бейрнп гмювемхи хдеюкэмни юву
f = [ft1 fk1 fk2 ft2];    % бейрнп цпюмхвмшу вюярнр
ripple = [d11 d2 d12];    % бейрнп люйяхлюкэмн дносярхлшу нрйкнмемхи
[R,f0,m0,weight] = firpmord(f,m,ripple,Fs);% бшвхякемхе оюпюлерпнб тсмйжхх firpmord
disp('%')
disp(['R = ' num2str(R)])                   % нжемйю онпъдйю тхкэрпю
weight = [weight(1) weight(2) weight(3)]    % беяю б оо Х ог
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.3. яхмрег йху-тхкэрпю пт')
ORDER = 0; % опхгмюй норхлюкэмнярх онпъдйю йху-тхкэрпю: 0 ≈ менорхлюкэмши; 1 - норхлюкэмши
while ORDER==0;
disp('%')
disp('%')
disp('% дКЪ ЯХМРЕГЮ йху-ТХКЭРПЮ пт МЮФЛХРЕ <ENTER>')
pause
[b4,error,opt] = firpm(R,f0,m0,weight);   % йнщттхжхемрш йху-тхкэрпю пт b4
disp('%')
disp('%')
disp(['  яХМРЕГХПНБЮМ йху-ТХКЭРП пт ОНПЪДЙЮ R = ' num2str(R)])
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ люйяхлюкэмни бгбеьеммни ньхайх юоопнйяхлюжхх error')
disp('% Х дносярхлнцн бгбеьеммнцн нрйкнмемхъ max{d11,d2,d12} МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp(['error = ' num2str(error)])         % тюйрхвеяйне люйяхлюкэмне нрйкнмемхе юву нр хдеюкэмни
disp(['max{d11,d2,d12} = ' num2str(max([d11,d2,d12]))]) % гюдюммне нрйкнмемхе max{d11,d2,d12}
disp('%')
disp('%')
disp('% яПЮБМХРЕ тюйрхвеяйне НРЙКНМЕМХЕ юву Я гюдюммшл')
disp('%')
disp('% еЯКХ онпъднй ЯННРБЕРЯРБСЕР лхмхлюкэмнлс, ББЕДХРЕ 1')
disp('% еЯКХ ме ЯННРБЕРЯРБСЕР, ББЕДХРЕ 0 Х ГЮРЕЛ онпъднй R')
ORDER = input('--> ');
if ORDER==0
R = input('R = ');                            % онпъднй йху-тхкэрпю
while rem(R,2)~=0
disp('% оНПЪДНЙ ТХКЭРПЮ БШАПЮМ меопюбхкэмн')
R = input('R = ');                            % онпъднй йху-тхкэрпю
end
end
end
disp('%')
disp([' яХМРЕГХПНБЮМ НОРХЛЮКЭМШИ пт ОНПЪДЙЮ R = ' num2str(R)])
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.4. юмюкхг уюпюйрепхярхй йху-тхкэрпю пт')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ цпютхйнб ху, юву х тву МЮФЛХРЕ <ENTER>')
pause
figure('Name','Bandstop FIR Filter - Impulse Response, Magnitude, Phase','NumberTitle', 'off')
plot_fir(R,b4,Fs)                % онярпнемхе цпютхйнб ху, юву Х тву
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.5. бшбнд цпютхйю юву норхлюкэмнцн йху-тхкэрпю я нрлевеммшлх вюярнрюлх юкэрепмюмяю')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ цпютхйю юву я вюярнрюлх юкэрепмюмяю МЮФЛХРЕ <ENTER>')
pause
fextr = opt.fextr;              % бейрнп мнплхпнбюммшу вюярнр юкэрепмюмяю
figure('Name','Bandstop Filter - Magnitude','NumberTitle', 'off')
MAG_fir(b4,opt.fextr,f0,m0,Fs)  % цпютхй юву я вюярнрюлх юкэрепмюмяю
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.6. нохяюмхе рпеанбюмхи й юву йху-ТХКЭРПЮ пт б бхде назейрю fdesign')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ ябниярб назейрю fdesign МЮФЛХРЕ <ENTER>')
pause
MAG_bandstop = fdesign.bandstop('Fp1,Fst1,Fst2,Fp2,Ap1,Ast,Ap2',ft1,fk1,fk2,ft2,Ap1,Ast,Ap2,Fs)        % назейр fdesign дкъ пт
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.7. яхмрег йху-тхкэрпю б бхде назейрю dfilt мю нямнбе назейрю fdesign')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ ябниярб назейрю dfilt МЮФЛХРЕ <ENTER>')
pause
F_bandstop = equiripple(MAG_bandstop)   % пт б бхде назейрю dfilt
disp('%')
disp('%')
disp('% яхмрег йху-тхкэрпю пт гюбепьем')





















































