script
clc
clear
disp('% кп ╧12. яхмрег йху-тхкэрпю тбв лернднл веашьебяйни юоопнйяхлюжхх')
disp('%')
disp('%')
disp('% О.1. ббнд рпеанбюмхи й юву тбв')
disp('%')
disp('%')
disp('% бБЕДХРЕ мнлеп апхцюдш Х рпеанбюмхъ Й юву')
DATA=0;
while DATA==0;
Nb = input('Nb = ');        % мнлеп апхцюдш
Fs = input('Fs = ');        % вюярнрю дхяйперхгюжхх (цЖ)
fk = input ('fk = ');       % цпюмхвмюъ вюярнрю ог (цЖ)
ft = input ('ft = ');       % цпюмхвмюъ вюярнрю оо (цЖ)
d2 = input('d2 = ');        % люйяхлюкэмн дносярхлне нрйкнмемхе б ог
d1 = input('d1 = ');        % люйяхлюкэмн дносярхлне нрйкнмемхе б оо
Ast = input('Ast = ');      % лхмхлюкэмн дносярхлне гюрсуюмхе б ог
Ap = input('Ap = ');        % люйяхлюкэмн дносярхлне гюрсуюмхе б оо
disp('% оПНБЕПЭРЕ опюбхкэмнярэ ББНДЮ хяундмшу дюммшу')
disp('% оПХ опюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 1')
disp('% оПХ меопюбхкэмшу хяундмшу дюммшу ББЕДХРЕ 0 Х онбрнпхре ББНД')
DATA = input('--> ');
end
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.2. бшвхякемхе оюпюлерпнб тсмйжхх firpmord')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ онпъдйю йху-ТХКЭРПЮ (R) Х беянб  Б ог Х оо (weight) МЮФЛХРЕ <ENTER>')
pause
m = [0 1];                % бейрнп гмювемхи хдеюкэмни юву
f = [fk ft];              % бейрнп цпюмхвмшу вюярнр
ripple = [d2 d1];         % бейрнп люйяхлюкэмн дносярхлшу нрйкнмемхи
[R,f0,m0,weight] = firpmord(f,m,ripple,Fs);% бшвхякемхе оюпюлерпнб тсмйжхх firpmord
disp('%')
disp(['R = ' num2str(R)])                 % нжемйю онпъдйю тхкэрпю
weight = [weight(1) weight(2)]            % беяю б ог Х оо
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.3. яхмрег йху-тхкэрпю тбв')
ORDER = 0; % опхгмюй норхлюкэмнярх онпъдйю йху-тхкэрпю: 0 ≈ менорхлюкэмши; 1 - норхлюкэмши
ftype = ' ';      % 1-и рхо йху-тхкэрпю тбв он слнквюмхч
while ORDER==0;
disp('%')
disp('%')
disp('% дКЪ ЯХМРЕГЮ йху-ТХКЭРПЮ тбв МЮФЛХРЕ <ENTER>')
pause
[b2,error,opt] = firpm(R,f0,m0,weight,ftype);     % йнщттхжхемрш йху-тхкэрпю тбв b2
disp('%')
disp('%')
disp(['  яХМРЕГХПНБЮМ йху-ТХКЭРП тбв ОНПЪДЙЮ R = ' num2str(R)])
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ люйяхлюкэмни бгбеьеммни ньхайх юоопнйяхлюжхх error')
disp('% Х дносярхлнцн бгбеьеммнцн нрйкнмемхъ max{d1,d2} МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp(['error = ' num2str(error)])           % тюйрхвеяйне люйяхлюкэмне нрйкнмемхе юву нр хдеюкэмни
disp(['max{d1,d2} = ' num2str(max(d1,d2))]) % гюдюммне нрйкнмемхе max{d1,d2}
disp('%')
disp('%')
disp('% яПЮБМХРЕ тюйрхвеяйне НРЙКНМЕМХЕ юву Я гюдюммшл')
disp('%')
disp('% еЯКХ онпъднй ЯННРБЕРЯРБСЕР лхмхлюкэмнлс, ББЕДХРЕ 1')
disp('% еЯКХ ме ЯННРБЕРЯРБСЕР, ББЕДХРЕ 0 Х ГЮРЕЛ онпъднй R')
disp('% Х рхо йху-ТХКЭРПЮ ftype - ОПНАЕК ХКХ hilbert б юонярпнтюу')
ORDER = input('--> ');
if ORDER==0
R = input('R = ');                           % онпъднй йху-тхкэрпю
ftype = input('ftype = ');
while (ftype==' ')&(rem(R,2)~=0)|(ftype=='hilbert')&(rem(R,2)~=1)               % опнбепйю яннрберярбхъ онпъдйю х рхою йху-тхкэрпю
disp('% рхо йху-ТХКЭРПЮ ме яннрберярбсер онпъдйс')
ftype = input('ftype = ');
end
end
end
disp('%')
disp([' яХМРЕГХПНБЮМ НОРХЛЮКЭМШИ тбв ОНПЪДЙЮ R = ' num2str(R)])
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.4. юмюкхг уюпюйрепхярхй йху-тхкэрпю тбв')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ цпютхйнб ху, юву х тву МЮФЛХРЕ <ENTER>')
pause
figure('Name','Highpass FIR Filter - Impulse Response, Magnitude, Phase','NumberTitle', 'off')
plot_fir(R,b2,Fs)                % онярпнемхе цпютхйнб ху, юву Х тву
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.5. бшбнд цпютхйю юву норхлюкэмнцн йху-тхкэрпю я нрлевеммшлх вюярнрюлх юкэрепмюмяю')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ цпютхйю юву я вюярнрюлх юкэрепмюмяю МЮФЛХРЕ <ENTER>')
pause
fextr = opt.fextr;              % бейрнп мнплхпнбюммшу вюярнр юкэрепмюмяю
figure('Name','Highpass Filter - Magnitude','NumberTitle', 'off')
MAG_fir(b2,opt.fextr,f0,m0,Fs)  % цпютхй юву я вюярнрюлх юкэрепмюмяю
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.6. нохяюмхе рпеанбюмхи й юву йху-ТХКЭРПЮ тбв б бхде назейрю fdesign')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ ябниярб назейрю fdesign МЮФЛХРЕ <ENTER>')
pause
MAG_highpass = fdesign.highpass('Fst,Fp,Ast,Ap',fk,ft,Ast,Ap,Fs) % назейр fdesign дкъ тбв
disp('%')
disp('%')
disp('% дКЪ ОПНДНКФЕМХЪ МЮФЛХРЕ <ENTER>')
pause
disp('%')
disp('%')
disp('% О.7. яхмрег йху-тхкэрпю б бхде назейрю dfilt мю нямнбе назейрю fdesign')
disp('%')
disp('%')
disp('% дКЪ БШБНДЮ ябниярб назейрю dfilt МЮФЛХРЕ <ENTER>')
pause
F_highpass = equiripple(MAG_highpass)   % тбв б бхде назейрю dfilt
disp('%')
disp('%')
disp('% яхмрег йху-тхкэрпю тбв гюбепьем')

























































